
* DONE 第一章矩阵测试题目 [62%]
  CLOSED: [2023-03-29 Wed 17:32]
  - State "DONE"       from "STARTED"    [2023-03-29 Wed 17:32]
  :LOGBOOK:
  CLOCK: [2023-03-29 Wed 16:30]--[2023-03-29 Wed 17:32] =>  1:02
  CLOCK: [2023-03-29 Wed 09:28]--[2023-03-29 Wed 10:08] =>  0:40
  CLOCK: [2023-03-29 Wed 10:15]--[2023-03-29 Wed 10:58] =>  0:43
  CLOCK: [2023-03-29 Wed 12:10]--[2023-03-29 Wed 12:36] =>  0:26
  CLOCK: [2023-03-29 Wed 14:00]--[2023-03-29 Wed 14:56] =>  0:56
  :END:
  :LOGBOOK
  :END:

- [X] 普通的乘法和倒置乘法
- [X] 矩阵的 ^2, ^3
- [X] 求某矩阵的逆矩阵
- [X] 逆矩阵方程: 给定某个方程组 Ax=B, 求 x.
- [X] 初等矩阵 E 变换
- [ ] 求线性方程组
  - [ ] 转换为最简梯矩阵
  - [ ] 判断是否有解
  - [ ] 解方程
- [ ] 判断是否为对称矩阵
- [ ] 求可交互矩阵

* TODO 第二章矩阵的测试题目 

* STARTED 收集行列式考点
  :LOGBOOK:
  CLOCK: [2023-03-29 Wed 18:35]--[2023-03-29 Wed 19:06] =>  0:31
  :END:

- [X] 求全排列的逆序数
- [X] 直接求 2, 3 阶行列式
- [ ] 把行列式转换为上三角或下三角的形式来求 3 阶以上的行列式
- [ ] 利用泛德蒙的方法分解行列式来求行列式

* DONE 求行列式的逆序数
  CLOSED: [2023-03-29 Wed 19:18] DEADLINE: <2023-03-29 Wed>
  - State "DONE"       from "STARTED"    [2023-03-29 Wed 19:18]
  :LOGBOOK:
  CLOCK: [2023-03-29 Wed 19:11]--[2023-03-29 Wed 19:18] =>  0:07
  :END:
* DONE 用对角线法求二，三阶行列式 
  CLOSED: [2023-03-29 Wed 19:30] DEADLINE: <2023-03-29 Wed>
  - State "DONE"       from "STARTED"    [2023-03-29 Wed 19:30]
  :LOGBOOK:
  CLOCK: [2023-03-29 Wed 19:18]--[2023-03-29 Wed 19:30] =>  0:12
  :END:
* DONE 用变换成上三角和下三角的方法求解三阶以上的行列式
  CLOSED: [2023-03-29 Wed 20:37] DEADLINE: <2023-03-29 Wed>
  - State "DONE"       from "STARTED"    [2023-03-29 Wed 20:37]
  :LOGBOOK:
  CLOCK: [2023-03-29 Wed 20:03]--[2023-03-29 Wed 20:37] =>  0:34
  :END:
* DONE 使用泛的蒙方法来分解行列式
  CLOSED: [2023-03-29 Wed 23:27] DEADLINE: <2023-03-29 Wed>
  - State "DONE"       from "STARTED"    [2023-03-29 Wed 23:27]
  :LOGBOOK:
  CLOCK: [2023-03-29 Wed 23:15]--[2023-03-29 Wed 23:27] =>  0:12
  CLOCK: [2023-03-29 Wed 20:48]--[2023-03-29 Wed 20:50] =>  0:02
  :END:

- [ ] 很好, 但是还没有结束. 